In [1]:
import pandas as pd
import numpy as np
import ast
import json

In [2]:
dfpaises= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\Production.csv')

dfpaises.rename(columns={'id':'id_original'}, inplace= True)

dfpaises.head()

,id_original,production_companies,production_countries
0,862,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_3166_1': 'US', 'name': 'United States o..."
1,8844,"[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'iso_3166_1': 'US', 'name': 'United States o..."
2,15602,"[{'name': 'Warner Bros.', 'id': 6194}, {'name'...","[{'iso_3166_1': 'US', 'name': 'United States o..."
3,31357,[{'name': 'Twentieth Century Fox Film Corporat...,"[{'iso_3166_1': 'US', 'name': 'United States o..."
4,11862,"[{'name': 'Sandollar Productions', 'id': 5842}...","[{'iso_3166_1': 'US', 'name': 'United States o..."

In [3]:
dfpaises.shape

(44936, 3)

In [4]:
dfpaises.dropna(inplace=True)

In [5]:
dfpaises['production_countries'] = dfpaises['production_countries'].apply(ast.literal_eval)

In [6]:
df_explodedpais = dfpaises.explode('production_countries')

def extract_companies_info(x):
    if isinstance(x, dict):
        return pd.Series([x.get('name', ''),x.get('iso_3166_1', '')])
    else:
        return pd.Series(['', ''])

df_explodedpais[['name', 'iso_3166_1']] = df_explodedpais['production_countries'].apply(extract_companies_info)

In [7]:
df_explodedpais.head()

,id_original,production_companies,production_countries,name,iso_3166_1
0,862,"[{'name': 'Pixar Animation Studios', 'id': 3}]","{'iso_3166_1': 'US', 'name': 'United States of...",United States of America,US
1,8844,"[{'name': 'TriStar Pictures', 'id': 559}, {'na...","{'iso_3166_1': 'US', 'name': 'United States of...",United States of America,US
2,15602,"[{'name': 'Warner Bros.', 'id': 6194}, {'name'...","{'iso_3166_1': 'US', 'name': 'United States of...",United States of America,US
3,31357,[{'name': 'Twentieth Century Fox Film Corporat...,"{'iso_3166_1': 'US', 'name': 'United States of...",United States of America,US
4,11862,"[{'name': 'Sandollar Productions', 'id': 5842}...","{'iso_3166_1': 'US', 'name': 'United States of...",United States of America,US

In [8]:
columnas_eliminar= ['production_companies', 'production_countries']
df_explodedpais.drop(columns=columnas_eliminar, inplace=True)

In [9]:
df_explodedpais.head()

   id_original                      name iso_3166_1
0          862  United States of America         US
1         8844  United States of America         US
2        15602  United States of America         US
3        31357  United States of America         US
4        11862  United States of America         US

In [11]:
df_explodedpais.shape

(55112, 3)

In [20]:
df_explodedpais['name'].unique().tolist()

['United States of America',
 'Germany',
 'United Kingdom',
 'France',
 'Italy',
 'Spain',
 'China',
 'Australia',
 'South Africa',
 'Canada',
 '',
 'Switzerland',
 'Belgium',
 'Japan',
 'Iran',
 'Netherlands',
 'Hong Kong',
 'Tunisia',
 'Ireland',
 'Dominican Republic',
 'Croatia',
 'Russia',
 'Macedonia',
 'Austria',
 'Taiwan',
 'New Zealand',
 'Mexico',
 'Poland',
 'Peru',
 'Cuba',
 'Liechtenstein',
 'Denmark',
 'Portugal',
 'Finland',
 'Sweden',
 'Argentina',
 'Iceland',
 'South Korea',
 'Serbia',
 'Hungary',
 'Czech Republic',
 'India',
 'Brazil',
 'Greece',
 'Congo',
 'Senegal',
 'Burkina Faso',
 'Romania',
 'Philippines',
 'Vietnam',
 'Trinidad and Tobago',
 'Bulgaria',
 'Chile',
 'Norway',
 'Kazakhstan',
 'Algeria',
 'Luxembourg',
 'Georgia',
 'Ukraine',
 'Botswana',
 'Aruba',
 'Israel',
 'Turkey',
 'Ecuador',
 'Lebanon',
 'Morocco',
 'Bosnia and Herzegovina',
 'Bahamas',
 'Malaysia',
 'Bhutan',
 'Jamaica',
 'Pakistan',
 'Nepal',
 "Cote D'Ivoire",
 'Thailand',
 'Namibia',
 'Cameroon',
 'Colombia',
 'Czechoslovakia',
 'Uruguay',
 'Slovenia',
 'Libyan Arab Jamahiriya',
 'Puerto Rico',
 'Soviet Union',
 'East Germany',
 'Singapore',
 'Afghanistan',
 'Malta',
 'Panama',
 'Egypt',
 'Zimbabwe',
 'Tajikistan',
 'Uzbekistan',
 'Costa Rica',
 'Kuwait',
 'Martinique',
 'Ghana',
 'Armenia',
 'Indonesia',
 'Mongolia',
 'Bolivia',
 'Monaco',
 'Iraq',
 'Slovakia',
 'Serbia and Montenegro',
 'Venezuela',
 'Lithuania',
 'Rwanda',
 'Palestinian Territory',
 'Chad',
 'Paraguay',
 'Qatar',
 'Estonia',
 'Macao',
 'Mali',
 'United States Minor Outlying Islands',
 'Latvia',
 'United Arab Emirates',
 'Azerbaijan',
 'Cayman Islands',
 'Nicaragua',
 'Liberia',
 'Yugoslavia',
 'Montenegro',
 'Angola',
 'Belarus',
 'Cambodia',
 'Mauritania',
 'Cyprus',
 'Bangladesh',
 'Syrian Arab Republic',
 'Kyrgyz Republic',
 'Albania',
 'Tanzania',
 'North Korea',
 'Kenya',
 'Jordan',
 'Uganda',
 'Saudi Arabia',
 'Somalia',
 'Guatemala',
 'Madagascar',
 'Ethiopia',
 'Sri Lanka',
 'Papua New Guinea',
 'Nigeria',
 "Lao People's Democratic Republic",
 'French Polynesia',
 'Netherlands Antilles',
 'Myanmar',
 'Bermuda',
 'El Salvador',
 'French Southern Territories',
 'Samoa',
 'Moldova',
 'Barbados',
 'Antarctica',
 'Gibraltar',
 'Brunei Darussalam',
 'Honduras',
 'Guinea']

In [45]:
grouped= df_explodedpais[['id_original', 'name']].groupby('name').count().reset_index()

In [46]:
grouped.head()

          name  id_original
0                      6081
1  Afghanistan            8
2      Albania            5
3      Algeria           13
4       Angola            3

In [47]:
grouped.columns

Index(['name', 'id_original'], dtype='object')

In [56]:
## agrupo concantidad de pelicula y ordeno
grouped.sort_values(by='id_original', ascending=False)

                         name  id_original
154  United States of America        21015
0                                     6081
152            United Kingdom         4073
51                     France         3900
55                    Germany         2240
..                        ...          ...
17                    Bermuda            1
105      Netherlands Antilles            1
61                   Honduras            1
125                     Samoa            1
60                     Guinea            1

[161 rows x 2 columns]

In [57]:
usa= grouped[grouped['name']=='United States of America']
usa.head()

                         name  id_original
154  United States of America        21015

In [58]:
grouped.to_csv('PaisesCANTpelis.csv', index=False)